back/js_practice_3/app/controllers/gifs_controller.rb

  def index
    @gifs = Gif.all
---
SELECT "gifs".* FROM "gifs"

  def create
    @gif = Gif.new(gif_params)

    if @gif.save
---
INSERT INTO "gifs" ("title", "gif_add", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ttiel"], ["gif_add", "sdfsd"], ["created_at", "2020-10-12 15:48:18.128608"], ["updated_at", "2020-10-12 15:48:18.128608"]]

  def update
    if @gif.update(gif_params)
---
UPDATE "gifs" SET "title" = ?, "gif_add" = ?, "updated_at" = ? WHERE "gifs"."id" = ?  [["title", ""], ["gif_add", ""], ["updated_at", "2020-10-13 01:10:23.080851"], ["id", 101]]

  def destroy
    @gif.destroy
---
DELETE FROM "gifs" WHERE "gifs"."id" = ?  [["id", 8]]

    def set_gif
      @gif = Gif.find(params[:id])
---
SELECT "gifs".* FROM "gifs" WHERE "gifs"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]